In [61]:
import pandas as pd

## 예제 8-4  사용자 정의 함수를 apply 메소드로  처리하기

In [62]:
import numpy as np

In [75]:
df = pd.DataFrame ({'a' : np.random.randn(6),
                 'b' : ['철수', '영희'] * 3,
                 'c' : np.random.randn(6)})

In [76]:
df

          a   b         c
0  0.560980  철수 -0.794660
1  0.220934  영희  0.669051
2  0.162829  철수  1.810738
3 -2.766559  영희 -0.506450
4 -0.839451  철수 -1.612495
5  0.259721  영희  0.228671

In [77]:
def my_test(a, c):
    return a % c

In [78]:
# lambda 함수는 행단위로 데이터를 처리하는 사용자 함수를 작성한다.
df['Value'] = df.apply(lambda df: my_test(df['a'], df['c']), axis=1)

In [79]:
df

          a   b         c     Value
0  0.560980  철수 -0.794660 -0.233679
1  0.220934  영희  0.669051  0.220934
2  0.162829  철수  1.810738  0.162829
3 -2.766559  영희 -0.506450 -0.234309
4 -0.839451  철수 -1.612495 -0.839451
5  0.259721  영희  0.228671  0.031049

In [80]:
df.a % df.c

0   -0.233679
1    0.220934
2    0.162829
3   -0.234309
4   -0.839451
5    0.031049
dtype: float64

In [84]:
# 일반함수는 데이터 프레임 전체를 넘겨 열 전체의 값을 반환하는 형태로 작성한다.
def my_test2(df):
    return df['a'] % df['c']

In [85]:
df['Value 2'] = df.apply(my_test2, axis=1)

In [86]:
df

          a   b         c     Value   Value 2
0  0.560980  철수 -0.794660 -0.233679 -0.233679
1  0.220934  영희  0.669051  0.220934  0.220934
2  0.162829  철수  1.810738  0.162829  0.162829
3 -2.766559  영희 -0.506450 -0.234309 -0.234309
4 -0.839451  철수 -1.612495 -0.839451 -0.839451
5  0.259721  영희  0.228671  0.031049  0.031049

%timeit 를 통해 서로 다른 방식에 대한 성능 비교를 할 수 있다.

In [99]:
%timeit df['Value3'] = df.apply(lambda df: my_test(df['a'], df['c']), axis=1)

449 µs ± 1.52 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [100]:
%timeit df['Value4'] = df.apply(my_test2, axis=1)

447 µs ± 869 ns per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [92]:
sample = pd.DataFrame({'임의의값':[10,100,40] })

In [93]:
sample

   임의의값
0    10
1   100
2    40

In [94]:
# 기존의 데이터 3개와 10만개의 데이터를 곱하여 30만개의 데이터를 생성한다.
# 인덱스는 갱신되어야 하므로 reset_index 함수 인자에 drop=True를 하면 새로운 인덱스로 갱신이된다.
sample = pd.concat([sample]*100000).reset_index(drop=True)

In [95]:
sample.shape

(300000, 1)

In [103]:
sample.head(10)

   임의의값
0    10
1   100
2    40
3    10
4   100
5    40
6    10
7   100
8    40
9    10

In [104]:
sample.shape

(300000, 1)

In [107]:
%timeit sample['임의의값'].apply(lambda x: np.nan if x < 90 else x)

66 ms ± 255 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [112]:
# 자기자신의 값은 변경되지 않으므로 추후 복제해서 적용해 본다.
sample.head()

   임의의값
0    10
1   100
2    40
3    10
4   100

In [113]:
%timeit sample['임의의값'].mask(sample['임의의값'] < 90, np.nan)

2.31 ms ± 49.6 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [114]:
sample1 = sample.copy()

In [115]:
sample1 = sample1['임의의값'].apply(lambda x: np.nan if x < 90 else x)

In [116]:
sample1.head()

0      NaN
1    100.0
2      NaN
3      NaN
4    100.0
Name: 임의의값, dtype: float64

In [117]:
sample2 = sample.copy()

In [118]:
sample2 = sample2['임의의값'].mask(sample['임의의값'] < 90, np.nan)

In [119]:
sample2.head()

0      NaN
1    100.0
2      NaN
3      NaN
4    100.0
Name: 임의의값, dtype: float64

In [120]:
(sample1 == sample2).shape

(300000,)

In [121]:
sample1.isnull().sum(), sample1.notnull().sum()

(200000, 100000)

In [122]:
(sample1 == sample2).sum()

100000

## 예제 8-5  사용자 정의 함수를 map,applymap메소드로  처리하기

In [123]:
import numpy as np

In [124]:
ser = pd.Series(np.random.randn(6))

In [125]:
ser

0    2.462358
1    0.231198
2   -1.546699
3   -0.504511
4   -0.484099
5   -1.381052
dtype: float64

In [134]:
df = pd.DataFrame(ser,columns=['관측값_A'])
df

      관측값_A
0  2.462358
1  0.231198
2 -1.546699
3 -0.504511
4 -0.484099
5 -1.381052

In [135]:
def map_test(a):
    print(" 원소별 처리")
    return np.abs(a)

In [136]:
ser.map(map_test)

 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리

0    2.462358
1    0.231198
2    1.546699
3    0.504511
4    0.484099
5    1.381052
dtype: float64

In [129]:
s = pd.Series(ser.map(map_test))

 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리

In [130]:
s

0    2.462358
1    0.231198
2    1.546699
3    0.504511
4    0.484099
5    1.381052
dtype: float64

In [137]:
df['관측값_A_절대값']=s
df

      관측값_A  관측값_A_절대값
0  2.462358   2.462358
1  0.231198   0.231198
2 -1.546699   1.546699
3 -0.504511   0.504511
4 -0.484099   0.484099
5 -1.381052   1.381052

## 예제 8-6 pipe 메소드 처리하기

In [140]:
import numpy as np

In [141]:
df = pd.DataFrame({"name": ['김상갑', '임종문', '조현웅'],
                   "program language": [np.nan, 'Python', 'Scala'],
                   "born": [pd.NaT, pd.Timestamp("1966-04-25"),
                             pd.NaT]})

In [142]:
df

  name program language       born
0  김상갑              NaN        NaT
1  임종문           Python 1966-04-25
2  조현웅            Scala        NaT

In [143]:
def name_length(df) :
    df['length'] = df.name.str.len()
    return df

In [144]:
# 판다스에서 pipe라는 함수로도 사용자 정의 함수를 지정할 수 있다.

In [145]:
df.pipe(name_length)

  name program language       born  length
0  김상갑              NaN        NaT       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala        NaT       3

In [146]:
def born_fillna(df) :
    df['born'] = df['born'].fillna(pd.Timestamp("1967-04-25"))
    return df

In [147]:
df.pipe(born_fillna)

  name program language       born  length
0  김상갑              NaN 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [148]:
def pl_fillna(df) :
    df['program language'] = df['program language'].fillna("Java")
    return df

In [149]:
df.pipe(pl_fillna)

  name program language       born  length
0  김상갑             Java 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [150]:
df1 = pd.DataFrame({"name": ['김상갑', '임종문', '조현웅'],
                   "program language": [np.nan, 'Python', 'Scala'],
                   "born": [pd.NaT, pd.Timestamp("1966-04-25"),
                             pd.NaT]})

In [151]:
df1

  name program language       born
0  김상갑              NaN        NaT
1  임종문           Python 1966-04-25
2  조현웅            Scala        NaT

In [152]:
df1.pipe(name_length).pipe(born_fillna).pipe(pl_fillna)

  name program language       born  length
0  김상갑             Java 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [153]:
df2 = pd.DataFrame()

In [154]:
df2['name'] = ['은옥찬', '은석찬', '은옥주']
df2['gender'] = ['Male', 'Male', 'Female']
df2['age'] = [31, 32, 19]

In [155]:
df2

  name  gender  age
0  은옥찬    Male   31
1  은석찬    Male   32
2  은옥주  Female   19

In [156]:
def mean_age_by_group(dataframe, col):
    return dataframe.groupby(col).mean()

In [157]:
mean_age_by_group(df2, 'gender')

         age
gender
Female  19.0
Male    31.5

In [158]:
def uppercase_column_name(dataframe):
    dataframe.columns = dataframe.columns.str.upper()
    return dataframe

In [159]:
uppercase_column_name(df2)

  NAME  GENDER  AGE
0  은옥찬    Male   31
1  은석찬    Male   32
2  은옥주  Female   19

In [160]:
df3 = pd.DataFrame()

In [161]:
df3['name'] = ['구옥찬', '구석찬', '구옥주']
df3['gender'] = ['Male', 'Male', 'Female']
df3['age'] = [31, 32, 19]

In [162]:
(df3.pipe(mean_age_by_group, col='gender')
   .pipe(uppercase_column_name))

         AGE
gender
Female  19.0
Male    31.5